
'''
В нас є список [1, 2, 3, 4, 5, 6, 7, 8, 9]. 
потрібно написати функцію, 
яка буде проходити по цьому списку 
та вводити лише непарні числа з цього списку.
'''

def print_odd_numbers(number_list):
    for number in number_list: # Проходимо по списку
        if number % 2 != 0: # Перевіряємо, чи число непарне
            print(number) # Виводимо непарне число

number_list = [1, 2, 3, 4, 5, 6, 7, 8, 9] # Наш список чисел
print_odd_numbers(number_list) # Викликаємо функцію з нашим списком

# Ctrl / - Швидке коментування рядків коду
# Ctrl L - to clear the terminal

print(4 % 2) # Перевірка, чи число 3 непарне (повинно вивести 1)